<a href="https://colab.research.google.com/github/SedasN/google-colab_test/blob/main/StudyPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
from random import randint

In [11]:
numbers = [randint(-50, 50) for _ in range(50)]

In [12]:
a = pd.Series(numbers)

In [13]:
a

0    -38
1      4
2    -41
3     -5
4    -38
5     22
6      0
7    -28
8    -17
9    -22
10   -11
11     8
12    29
13   -13
14    -4
15    34
16   -30
17    22
18   -14
19   -40
20    15
21    30
22   -34
23   -12
24   -35
25    19
26    19
27    -3
28    18
29    30
30    28
31    14
32    -1
33   -46
34    38
35    -8
36   -49
37   -21
38    32
39    30
40   -34
41     7
42   -43
43   -23
44    47
45    18
46     6
47    36
48    15
49    -8
dtype: int64

In [21]:
a.tail()

45    18
46     6
47    36
48    15
49    -8
dtype: int64

In [26]:
a.take([])

Series([], dtype: int64)

In [28]:
list(range(5,10))

[5, 6, 7, 8, 9]

In [30]:
a.take(range(5, 10, 1))

5    22
6     0
7   -28
8   -17
9   -22
dtype: int64

In [31]:
len(a)

50

In [32]:
a[4:10]

4   -38
5    22
6     0
7   -28
8   -17
9   -22
dtype: int64